app/controllers/imageposts_controller.rb

  def index
    @imageposts = Imagepost.all
---
SELECT "imageposts".* FROM "imageposts"

  def create
    @imagepost = Imagepost.new(imagepost_params)

    respond_to do |format|
      if @imagepost.save
---
INSERT INTO "imageposts" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "Monkey"], ["created_at", "2022-04-29 08:35:25.025645"], ["updated_at", "2022-04-29 08:35:25.025645"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @imagepost.update(imagepost_params)
---
UPDATE "imageposts" SET "updated_at" = ? WHERE "imageposts"."id" = ?  [["updated_at", "2022-04-29 08:35:25.051839"], ["id", 7]]

  def destroy
    @imagepost.destroy
---
DELETE FROM "imageposts" WHERE "imageposts"."id" = ?  [["id", 6]]

  def mypage
     @imageposts = current_user.Imageposts.all
---
SELECT "imageposts".* FROM "imageposts" WHERE "imageposts"."user_id" = ?  [["user_id", 1]]

  def search
    @imageposts = Imagepost.where("title LIKE ?","%"+params[:q]+"%")
---
SELECT "imageposts".* FROM "imageposts" WHERE (title LIKE '%Monkey%')

    def set_imagepost
      @imagepost = Imagepost.find(params[:id])
---
SELECT "imageposts".* FROM "imageposts" WHERE "imageposts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]